## S05-L003 - Swaplevel

In [1]:
import pandas as pd
import numpy as np

In [2]:
fuel = pd.read_csv('course-files/fuel.csv', usecols=['Year','Make','Model','Range (FT1)','City Range (FT1)'])

In [5]:
fuel.set_index(['Year','Make','Model'], inplace=True)

In [6]:
fuel.sort_index(inplace=True)

In [7]:
fuel = fuel.swaplevel(0,1).sort_index()

In [8]:
fuel.head()

                                     Range (FT1)  City Range (FT1)
Make       Year Model
AM General 1984 DJ Po Vehicle 2WD            0.0               0.0
                DJ Po Vehicle 2WD            0.0               0.0
                FJ8c Post Office             0.0               0.0
                FJ8c Post Office             0.0               0.0
           1985 Post Office DJ5 2WD          0.0               0.0

In [16]:
y = 1984
m = 'Alfa Romeo'
mo = 'Spider Veloce 2000'

In [17]:
fuel.head()

                                     Range (FT1)  City Range (FT1)
Make       Year Model
AM General 1984 DJ Po Vehicle 2WD            0.0               0.0
                DJ Po Vehicle 2WD            0.0               0.0
                FJ8c Post Office             0.0               0.0
                FJ8c Post Office             0.0               0.0
           1985 Post Office DJ5 2WD          0.0               0.0

In [18]:
fuel.loc[(m,y,mo)]

                                    Range (FT1)  City Range (FT1)
Make       Year Model
Alfa Romeo 1984 Spider Veloce 2000          0.0               0.0
                Spider Veloce 2000          0.0               0.0

In [19]:
fuel = fuel.swaplevel().sort_index()

In [20]:
fuel.head()

                                     Range (FT1)  City Range (FT1)
Make       Model               Year
AM General DJ Po Vehicle 2WD   1984          0.0               0.0
                               1984          0.0               0.0
           FJ8c Post Office    1984          0.0               0.0
                               1984          0.0               0.0
           Post Office DJ5 2WD 1985          0.0               0.0

In [21]:
fuel.loc[(m,mo,y)]

                                    Range (FT1)  City Range (FT1)
Make       Model              Year
Alfa Romeo Spider Veloce 2000 1984          0.0               0.0
                              1984          0.0               0.0